Autodesk.Revit.DB.RevitLinkOptions.SetWorksetConfiguration(Autodesk.Revit.DB.WorksetConfiguration)
Sets the set of worksets to open when creating the link.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.RevitLinkOptions.#ctor(System.Boolean,Autodesk.Revit.DB.WorksetConfiguration)
Creates a RevitLinkOptions object, specifying relative or absolute path type,
and the desired workset configuration.
relative:
True if the link should use a relative path. False if it should use an
absolute path.
config:
A WorksetConfiguration object specifying the worksets to open when creating
the link.
Leave as null if the file is not workshared.
Optionally, this may also be null for a workshared
file, in which case Revit will open all worksets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.RevitLinkOptions.#ctor(Autodesk.Revit.DB.RevitLinkOptions)
Constructs a new copy of the input RevitLinkOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013